[
  {
    "id": 1,
    "type": "game",
    "title": "paradygm",
    "technology": [
      "unity",
      "c#"
    ],
    "description": [
      "Designed an immersive game universe with Unity, creating a mysterious house full of puzzles and secrets to discover, offering a captivating and exploration-rich experience.",
      "Developed interactive game mechanics in C#, including complex puzzles and logical challenges that test players' intelligence and insight, enhancing engagement and retention.",
      "Integrated narrative elements to enrich the gameplay experience, using dialogues, journals, and clues scattered throughout the house to gradually unveil the mysterious story behind Paradygm."
    ],
    "github": "https://github.com/ndogota/paradygm"
  },
  {
    "id": 2,
    "type": "mobile",
    "title": "e_garden",
    "technology": [
      "react native",
      "nodejs",
      "mongodb"
    ],
    "description": [
      "Developed a cross-platform mobile app with React Native, allowing users to remotely monitor and manage their gardens through an intuitive interface.",
      "Built a robust backend using Node.js and MongoDB to store and efficiently manage plant data, including moisture, temperature, and sunlight exposure.",
      "Integrated an automation system based on Raspberry Pi and Python with Flask, enabling real-time control of irrigation and lighting systems, reducing manual intervention and optimizing plant growth."
    ],
    "github": "https://github.com/ndogota/e_garden_5617da376"
  },
  {
    "id": 3,
    "type": "script",
    "title": "my_ls",
    "technology": [
      "c"
    ],
    "description": [
      "Implemented a custom version of the Unix 'ls' command.",
      "Handled options such as 'l' for long format, 'a' for hidden files, and 'r' for reverse order display."
    ],
    "github": "https://github.com/ndogota/my_ls"
  },
  {
    "id": 4,
    "type": "script",
    "title": "my_parallelepiped",
    "technology": [
      "c"
    ],
    "description": [
      "Designed an application to display a parallelepiped, including its volume and surface area, based on given dimensions.",
      "Created a simple user interface to input dimensions and select desired calculations.",
      "Implemented input validation to ensure data accuracy and precise calculations."
    ],
    "github": "https://github.com/ndogota/my_parallelepiped"
  },
  {
    "id": 5,
    "type": "software",
    "title": "stack_machine",
    "technology": [
      "c"
    ],
    "description": [
      "Developed a simulated stack machine to execute basic instructions, mimicking the functionality of a simplified CPU architecture.",
      "Supported basic arithmetic operations, value storage, and retrieval in the stack.",
      "Created a custom scripting language to load and execute scripts defining stack instructions and initial values."
    ],
    "github": "https://github.com/ndogota/stack_machine"
  },
  {
    "id": 6,
    "type": "game",
    "title": "bomberman",
    "technology": [
      "c",
      "sdl"
    ],
    "description": [
      "Created a clone of the classic Bomberman game in C, featuring a local multiplayer mode.",
      "Managed character movement, bomb placement, and power-up collection in a dynamic game environment.",
      "Implemented a simple game engine and graphical interface for an engaging user experience."
    ],
    "github": "https://github.com/ndogota/bomberman_c"
  },
  {
    "id": 7,
    "type": "script",
    "title": "little_ansible",
    "technology": [
      "python"
    ],
    "description": [
      "Created a tool inspired by Ansible to automate configuration and management of Unix/Linux systems.",
      "Developed Python scripts for routine tasks, such as software updates and service configuration.",
      "Supported modular and reusable configurations, allowing easy customization for various environments."
    ],
    "github": "https://github.com/ndogota/little_ansible"
  },
  {
    "id": 8,
    "type": "software",
    "title": "chroot_manager",
    "technology": [
      "python"
    ],
    "description": [
      "Developed a management interface to create and handle secure chroot environments on Linux systems.",
      "Automated the creation of chroot environments, including copying required binaries and configuring isolated environments.",
      "Added features to save and restore chroot states, facilitating application testing and deployment."
    ],
    "github": "https://github.com/ndogota/chroot_manager"
  },
  {
    "id": 9,
    "type": "software",
    "title": "reco_face",
    "technology": [
      "python",
      "cloud azure"
    ],
    "description": [
      "Designed a facial recognition system using Azure cloud services for image analysis.",
      "Integrated the Azure Face API to detect, identify, and verify faces in images or video streams.",
      "Implemented sound alerts when specific parameters configured in the application are met."
    ],
    "github": "https://github.com/ndogota/reco_face"
  },
  {
    "id": 10,
    "type": "script",
    "title": "distrib_builder",
    "technology": [
      "bash"
    ],
    "description": [
      "Simplified the use of the 'man' command.",
      "Created a script to launch shell scripts from selectable folders, aimed at package installation."
    ],
    "github": "https://github.com/ndogota/distrib_builder"
  },
  {
    "id": 11,
    "type": "game",
    "title": "pong_js",
    "technology": [
      "javascript"
    ],
    "description": [
      "Designed and developed a modern version of the classic Pong game using pure JavaScript, applying object-oriented programming principles to manage game entities like paddles and the ball.",
      "Implemented collision and bounce mechanics to simulate realistic gameplay, with progressive difficulty levels."
    ],
    "github": "https://github.com/ndogota/pong_js"
  },
  {
    "id": 12,
    "type": "web",
    "title": "pokedex_js",
    "technology": [
      "reactjs"
    ],
    "description": [
      "Implemented a Pokedex using an API to list detailed Pokémon information.",
      "Added pagination and filtering systems to enhance user experience while browsing the Pokémon database."
    ],
    "github": "https://github.com/ndogota/pokedex_js"
  },
  {
    "id": 14,
    "type": "web",
    "title": "ownleadr",
    "technology": [
      "html",
      "css",
      "javascript"
    ],
    "description": [
      "Developed an online project management dashboard with features for task creation, team member assignment, and progress tracking.",
      "Utilized advanced HTML, CSS, and JavaScript techniques to create a dynamic and responsive user interface suitable for various devices and screen sizes.",
      "Integrated drag-and-drop functionality for intuitive task management and implemented real-time notifications to keep users informed of important updates."
    ],
    "github": "https://github.com/ndogota/ownleadrwebsite"
  },
  {
    "id": 15,
    "type": "web",
    "title": "mayara_clothing",
    "technology": [
      "shopify"
    ],
    "description": [
      "Designed and developed an online store for Mayara Clothing using Shopify, customized with HTML, CSS, and JavaScript for a unique brand identity.",
      "Implemented advanced e-commerce features such as product filters, image carousels, and payment integrations for a smooth and secure user experience.",
      "Optimized the site for SEO and performance, ensuring fast navigation and improved search engine visibility."
    ],
    "github": "https://github.com/ndogota/mayaraclothing"
  },
  {
    "id": 16,
    "type": "software",
    "title": "database_model",
    "technology": [
      "mysql"
    ],
    "description": [
      "Designed and implemented a robust database model using MySQL Workbench, optimized for performance and scalability, supporting backend operations of various applications.",
      "Developed normalized database schemas to ensure data integrity and consistency, with stored procedures and triggers for automating common tasks.",
      "Implemented backup and recovery strategies, along with security measures to protect sensitive information from unauthorized access."
    ],
    "github": "https://github.com/ndogota/database_model"
  },
  {
    "id": 17,
    "type": "mobile",
    "title": "where_eat_app",
    "technology": [
      "java",
      "kotlin",
      "php"
    ],
    "description": [
      "Developed a cross-platform mobile app for restaurant discovery, using Java for Android, Kotlin for specific features, and PHP for the backend.",
      "Integrated geolocation features to recommend restaurants based on users' current locations, including reviews, ratings, and photos.",
      "Designed an intuitive user interface and a personalized recommendation system based on users' preferences and eating habits."
    ],
    "github": "https://github.com/ndogota/where_eat_app"
  },
  {
    "id": 18,
    "type": "web",
    "title": "algo_sort",
    "technology": [
      "php"
    ],
    "description": [
      "Created scripts to demonstrate various sorting algorithms implemented in PHP.",
      "Developed interfaces to allow users to visualize in real time how sorting algorithms work on data sets.",
      "Integrated options to compare algorithm performance, including execution time and operation count, to educate users on algorithm efficiency."
    ],
    "github": "https://github.com/ndogota/algo_sort"
  },
  {
    "id": 19,
    "type": "network",
    "title": "kubernetes_cluster_k8s",
    "technology": [
      "kubernetes",
      "k8s"
    ],
    "description": [
      "Set up a Kubernetes cluster (k8s) to orchestrate Docker containers, facilitating deployment, scaling, and management of containerized applications.",
      "Configured services, pods, and persistent volumes to ensure high availability and data persistence in distributed environments.",
      "Used Helm charts to simplify application package deployment and implemented zero-downtime update strategies."
    ],
    "github": "https://github.com/ndogota/kubernetes_cluster_k8s"
  },
  {
    "id": 20,
    "type": "network",
    "title": "kubernetes_cluster_k3s",
    "technology": [
      "kubernetes",
      "k3s"
    ],
    "description": [
      "Deployed a lightweight Kubernetes cluster (k3s) tailored for resource-constrained environments, such as IoT and edge computing.",
      "Configured and managed the cluster using k3s to deliver the same functionality as k8s with reduced memory and CPU usage.",
      "Integrated CI/CD pipelines to automate application deployment and management within the k3s cluster, ensuring rapid and reliable code delivery."
    ],
    "github": "https://github.com/ndogota/kubernetes_cluster_k3s"
  },
  {
    "id": 21,
    "type": "network",
    "title": "monitoring_fonctionnel",
    "technology": [
      "zabbix"
    ],
    "description": [
      "Implemented a functional monitoring solution with Zabbix to monitor real-time performance and availability of systems and applications.",
      "Configured custom dashboards to display critical metrics and alerts, enabling quick problem detection and proactive resolution.",
      "Automated data collection and report generation to provide operational insights and support performance optimization decisions."
    ],
    "github": "https://github.com/ndogota/server_monitoring"
  }
]